{
  "films": [
    {
      "id": 253,
      "overview": "James Bond must investigate a mysterious murder case of a British agent in New Orleans. Soon he finds himself up against a gangster boss named Mr. Big.",
      "release_date": "1973-07-05",
      "title": "Live and Let Die",
      "bond": "Roger Moore"
    },
    {
      "id": 646,
      "overview": "In the film that launched the James Bond saga, Agent 007 battles mysterious Dr. No, a scientific genius bent on destroying the U.S. space program. As the countdown to disaster begins, Bond must go to Jamaica, where he encounters beautiful Honey Ryder, to confront a megalomaniacal villain in his massive island headquarters.",
      "release_date": "1962-10-04",
      "title": "Dr. No",
      "bond": "Sean Connery"
    },
    {
      "id": 657,
      "overview": "Agent 007 is back in the second installment of the James Bond series, this time battling a secret crime organization known as SPECTRE. Russians Rosa Klebb and Kronsteen are out to snatch a decoding device known as the Lektor, using the ravishing Tatiana to lure Bond into helping them. Bond willingly travels to meet Tatiana in Istanbul, where he must rely on his wits to escape with his life in a series of deadly encounters with the enemy",
      "release_date": "1963-10-11",
      "title": "From Russia with Love",
      "bond": "Sean Connery"
    },
    {
      "id": 658,
      "overview": "Special agent 007 comes face to face with one of the most notorious villains of all time, and now he must outwit and outgun the powerful tycoon to prevent him from cashing in on a devious scheme to raid Fort Knox -- and obliterate the world's economy.",
      "release_date": "1964-09-17",
      "title": "Goldfinger",
      "bond": "Sean Connery"
    },
    {
      "id": 660,
      "overview": "A criminal organization has obtained two nuclear bombs and are asking for a 100 million pound ransom in the form of diamonds in seven days or they will use the weapons. The secret service sends James Bond to the Bahamas to once again save the world.",
      "release_date": "1965-12-15",
      "title": "Thunderball",
      "bond": "Sean Connery"
    },
    {
      "id": 667,
      "overview": "A mysterious spacecraft captures Russian and American space capsules and brings the two superpowers to the brink of war. James Bond investigates the case in Japan and comes face to face with his archenemy Blofeld.",
      "release_date": "1967-06-12",
      "title": "You Only Live Twice",
      "bond": "Sean Connery"
    },
    {
      "id": 668,
      "overview": "James Bond tracks his archnemesis, Ernst Blofeld, to a mountaintop retreat where he is training an army of beautiful, lethal women. Along the way, Bond falls for Italian contessa Tracy Draco, and marries her in order to get closer to Blofeld.",
      "release_date": "1969-12-12",
      "title": "On Her Majesty's Secret Service",
      "bond": "George Lazenby"
    },
    {
      "id": 681,
      "overview": "Diamonds are stolen only to be sold again in the international market. James Bond infiltrates a smuggling mission to find out who’s guilty. The mission takes him to Las Vegas where Bond meets his archenemy Blofeld.",
      "release_date": "1971-12-13",
      "title": "Diamonds Are Forever",
      "bond": "Sean Connery"
    },
    {
      "id": 682,
      "overview": "A golden bullet has 007 engraved on it as it smashes into the secret service headquarters. The bullet came from the professional killer Scaramanga who has yet to miss a target and James Bond begins a mission to try and stop him.",
      "release_date": "1974-12-01",
      "title": "The Man with the Golden Gun",
      "bond": "Roger Moore"
    },
    {
      "id": 691,
      "overview": "Russian and British submarines with nuclear missiles on board both vanish from sight without a trace. England and Russia both blame each other as James Bond tries to solve the riddle of the disappearing ships. But the KGB also has an agent on the case.",
      "release_date": "1977-07-07",
      "title": "The Spy Who Loved Me",
      "bond": "Roger Moore"
    },
    {
      "id": 698,
      "overview": "After Drax Industries' Moonraker space shuttle is hijacked, secret agent James Bond is assigned to investigate, traveling to California to meet the company's owner, the mysterious Hugo Drax. With the help of scientist Dr. Holly Goodhead, Bond soon uncovers Drax's nefarious plans for humanity, all the while fending off an old nemesis, Jaws, and venturing to Venice, Rio, the Amazon...and outer space.",
      "release_date": "1979-06-26",
      "title": "Moonraker",
      "bond": "Roger Moore"
    },
    {
      "id": 699,
      "overview": "A British spy ship has sunk and on board was a hi-tech encryption device. James Bond is sent to find the device that holds British launching instructions before the enemy Soviets get to it first.",
      "release_date": "1981-06-23",
      "title": "For Your Eyes Only",
      "bond": "Roger Moore"
    },
    {
      "id": 700,
      "overview": "James Bond is sent to investigate after a fellow “00” agent is found dead with a priceless Fabergé egg. James Bond follows the mystery and uncovers a smuggling scandal and a Russian General who wants to provoke a new World War.",
      "release_date": "1983-06-05",
      "title": "Octopussy",
      "bond": "Roger Moore"
    },
    {
      "id": 707,
      "overview": "A newly developed microchip designed by Zorin Industries for the British Government that can survive the electromagnetic radiation caused by a nuclear explosion has landed in the hands of the KGB. James Bond must find out how and why. His suspicions soon lead him to big industry leader Max Zorin.",
      "release_date": "1985-05-24",
      "title": "A View to a Kill",
      "bond": "Roger Moore"
    },
    {
      "id": 709,
      "overview": "When drug lord Franz Sanchez exacts his brutal vengeance on Bond's friend Felix Leiter, 007 resigns from the British Secret Service and begins a fierce vendetta against the master criminal. Bond won't be satisfied until Sanchez is defeated, and to accomplish this aim he allies himself with a beautiful pilot and Sanchez's sexy girlfriend.",
      "release_date": "1989-07-07",
      "title": "Licence to Kill",
      "bond": "Timothy Dalton"
    },
    {
      "id": 710,
      "overview": "James Bond must unmask the mysterious head of the Janus Syndicate and prevent the leader from utilizing the GoldenEye weapons system to inflict devastating revenge on Britain.",
      "release_date": "1995-11-16",
      "title": "GoldenEye",
      "bond": "Pierce Brosnan"
    },
    {
      "id": 714,
      "overview": "A deranged media mogul is staging international incidents to pit the world’s superpowers against each other. Now 007 must take on this evil mastermind in an adrenaline-charged battle to end his reign of terror and prevent global pandemonium.",
      "release_date": "1997-12-11",
      "title": "Tomorrow Never Dies",
      "bond": "Pierce Brosnan"
    },
    {
      "id": 10764,
      "overview": "Quantum of Solace continues the adventures of James Bond after Casino Royale. Betrayed by Vesper, the woman he loved, 007 fights the urge to make his latest mission personal. Pursuing his determination to uncover the truth, Bond and M interrogate Mr. White, who reveals that the organization that blackmailed Vesper is far more complex and dangerous than anyone had imagined.",
      "release_date": "2008-10-30",
      "title": "Quantum of Solace",
      "bond": "Daniel Craig"
    },
    {
      "id": 36557,
      "overview": "Le Chiffre, a banker to the world's terrorists, is scheduled to participate in a high-stakes poker game in Montenegro, where he intends to use his winnings to establish his financial grip on the terrorist market. M sends Bond—on his maiden mission as a 00 Agent—to attend this game and prevent Le Chiffre from winning. With the help of Vesper Lynd and Felix Leiter, Bond enters the most important poker game in his already dangerous career.",
      "release_date": "2006-11-14",
      "title": "Casino Royale",
      "bond": "Daniel Craig"
    },
    {
      "id": 36643,
      "overview": "Greed, revenge, world dominance and high-tech terrorism – it's all in a day's work for Bond, who's on a mission to protect a beautiful oil heiress from a notorious terrorist. In a race against time that culminates in a dramatic submarine showdown, Bond works to defuse the international power struggle that has the world's oil supply hanging in the balance.",
      "release_date": "1999-11-17",
      "title": "The World Is Not Enough",
      "bond": "Pierce Brosnan"
    },
    {
      "id": 36669,
      "overview": "Bond takes on a North Korean leader who undergoes DNA replacement procedures that allow him to assume different identities. American agent, Jinx Johnson assists Bond in his attempt to thwart the villain's plans to exploit a satellite that is powered by solar energy.",
      "release_date": "2002-11-17",
      "title": "Die Another Day",
      "bond": "Pierce Brosnan"
    },
    {
      "id": 37724,
      "overview": "When Bond's latest assignment goes gravely wrong and agents around the world are exposed, MI6 is attacked forcing M to relocate the agency. These events cause her authority and position to be challenged by Gareth Mallory, the new Chairman of the Intelligence and Security Committee. With MI6 now compromised from both inside and out, M is left with one ally she can trust: Bond. 007 takes to the shadows - aided only by field agent, Eve - following a trail to the mysterious Silva, whose lethal and hidden motives have yet to reveal themselves.",
      "release_date": "2012-10-25",
      "title": "Skyfall",
      "bond": "Daniel Craig"
    },
    {
      "id": 206647,
      "overview": "A cryptic message from Bond’s past sends him on a trail to uncover a sinister organization. While M battles political forces to keep the secret service alive, Bond peels back the layers of deceit to reveal the terrible truth behind SPECTRE.",
      "release_date": "2015-10-26",
      "title": "Spectre",
      "bond": "Daniel Craig"
    },
    {
      "id": 708,
      "overview": "James Bond helps a Russian General escape into the west. He soon finds out that the KGB wants to kill him for helping the General. A little while later the General is kidnapped from the Secret Service leading 007 to be suspicious.",
      "release_date": "1987-06-29",
      "title": "The Living Daylights",
      "bond": "Timothy Dalton"
    },
    {
      "id": 36670,
      "overview": "James Bond returns as the secret agent 007 one more time to battle the evil organization SPECTRE. Bond must defeat Largo, who has stolen two atomic warheads for nuclear blackmail. But Bond has an ally in Largo's girlfriend, the willowy Domino, who falls for Bond and seeks revenge. This is the last time for Sean Connery as Her Majesty's Secret Agent 007. Made outside of the traditional Broccoli production environment due to separate rights having been obtained for this specific Ian Fleming story.",
      "release_date": "1983-10-07",
      "title": "Never Say Never Again",
      "bond": "Sean Connery"
    }
  ]
}